app/Http/Controllers/Frontend/FilterController.php

select * from `products`
---
    public function ListRestaurant(Request $request)
    {
        // $filter = $request->input('filter');
        // $city = $request->input('city');
        // $category = $request->input('category');
        // $search = $request->input('search');
        // $product = Product::where('status', 1)->where('name', 'like', '%' . $search . '%')->get();
        $products = Product::all();

select * from `products` where `category_id` in ('3', '2') and `city_id` in ('4', '3', '2') and `menu_id` in ('9', '8', '7', '6', '5', '4', '3', '1')
---
    public function FilterpProducts(Request $request)
    {
        // dd($request->all());
        $categoryId = $request->input('categorys');
        $cityId = $request->input('citys');
        $menuId = $request->input('menus');
        $products = Product::query();
        // dd($categoryId, $cityId, $menuId);
        if ($categoryId) {
            $products->whereIn('category_id', $categoryId);
        }
        if ($cityId) {
            $products->whereIn('city_id', $cityId);
        }
        if ($menuId) {
            $products->whereIn('menu_id', $menuId);
        }
        $product = $products->get();