app/Http/Controllers/Frontend/HomeController.php

    public function RestaurantDetail($id)
    {
        $restaurant = Client::find($id);
        $menus = Menu::where('client_id', $restaurant->id)->latest()->get()->filter(function ($menu) {
            return $menu->products->count() > 0;
        });
        $reviews = Review::where('client_id', $restaurant->id)->get();
        $total_reviews = Review::where('client_id', $restaurant->id)->count();
        $total_reviews_sum = Review::where('client_id', $restaurant->id)->sum('rating');
        $average_rating = round(($total_reviews > 0 ? $total_reviews_sum / $total_reviews : 0), 1);
        $ratingCount =[
            'one' => Review::where('client_id', $restaurant->id)->where('rating', '1')->count(),
            'two' => Review::where('client_id', $restaurant->id)->where('rating', '2')->count(),
            'three' => Review::where('client_id', $restaurant->id)->where('rating', '3')->count(),
            'four' => Review::where('client_id', $restaurant->id)->where('rating', '4')->count(),
            'five' => Review::where('client_id', $restaurant->id)->where('rating', '5')->count(),
        ];
        $ratingPercent = [
            'one' => round(($ratingCount['one'] > 0 ? $ratingCount['one'] / $total_reviews * 100 : 0), 1),
            'two' => round(($ratingCount['two'] > 0 ? $ratingCount['two'] / $total_reviews * 100 : 0), 1),
            'three' => round(($ratingCount['three'] > 0 ? $ratingCount['three'] / $total_reviews * 100 : 0), 1),
            'four' => round(($ratingCount['four'] > 0 ? $ratingCount['four'] / $total_reviews * 100 : 0), 1),
            'five' => round(($ratingCount['five'] > 0 ? $ratingCount['five'] / $total_reviews * 100 : 0), 1),
        ];

        $revies_ratting = ReviesRateing::where('client_id', $restaurant->id)->first();
        $galarys = Gllery::where('client_id', $restaurant->id)->get();
---
select * from `clients` where `clients`.`id` = '3' limit 1
select * from `menus` where `client_id` = 3 order by `created_at` desc
select * from `products` where `products`.`menu_id` = 9 and `products`.`menu_id` is not null
select * from `reviews` where `client_id` = 3
select count(*) as aggregate from `reviews` where `client_id` = 3
select sum(`rating`) as aggregate from `reviews` where `client_id` = 3
select count(*) as aggregate from `reviews` where `client_id` = 3 and `rating` = '1'
select count(*) as aggregate from `reviews` where `client_id` = 3 and `rating` = '2'
select count(*) as aggregate from `reviews` where `client_id` = 3 and `rating` = '3'
select count(*) as aggregate from `reviews` where `client_id` = 3 and `rating` = '4'
select count(*) as aggregate from `reviews` where `client_id` = 3 and `rating` = '5'
select * from `revies_rateings` where `client_id` = 3 limit 1
select * from `glleries` where `client_id` = 3