app/Http/Controllers/Frontend/ReviewsController.php

    public function CommentStore(Request $request)
    {

        $userData = Auth::id();
        //get current url
        $url = url()->current();
        $referer = $_SERVER['HTTP_REFERER'];
        $splite = explode('/', $referer);
        $last = end($splite);
        // fist count review
        $count = Review::where('client_id', $last)->where('user_id', Auth::id())->where('status', 1)->count();
---
select count(*) as aggregate from `reviews` where `client_id` = '3' and `user_id` = 3 and `status` = 1

    public function AdminPendingReview()
    {
        $reviews = Review::all();
---
select * from `reviews`

    public function AdminApprovedReview()
    {
        $reviews = Review::where('status', 1)->get();
---
select * from `reviews` where `status` = 0

    public function AdminchangeReviewStatus(Request $request)
    {
        // dd($request->id, $request->status);
        $reviews = Review::find($request->id);
        if($request->status == 1){
            $reviews->status = 0;
        }else{
            $reviews->status = 1;
        }
        // dd($reviews->status);
        $reviews->status = $request->status;
        $reviews->save();
---
select * from `reviews` where `reviews`.`id` = '3' limit 1
update `reviews` set `status` = '1', `reviews`.`updated_at` = '2024-10-31 18:06:13' where `id` = 3

    public function ClientReviewAll()
    {
        $user = Auth::guard('client')->user()->id;
        $reviews = Review::where('user_id', $user)->get();
---
select * from `reviews` where `user_id` = 3

    public function ClientchangeReviewStatus(Request $request)
    {
        // dd($request->id, $request->status);
        $reviews = Review::find($request->id);
        if($request->status == 1){
            $reviews->status = 0;
        }else{
            $reviews->status = 1;
        }
        // dd($reviews->status);
        $reviews->status = $request->status;
        $reviews->save();
---
select * from `reviews` where `reviews`.`id` = '5' limit 1
update `reviews` set `status` = '1', `reviews`.`updated_at` = '2024-10-31 18:34:19' where `id` = 5