app/Http/Controllers/Admin/ManageController.php

select * from `products` order by `created_at` desc
---
    public function AllProduct()
    {
        $products = Product::latest()->get();